ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_UART.cpp
// Copyright Microsoft Corporation
// Copyright Oberon microsystems, Inc
// Copyright GHI Electronics, LLC
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <algorithm>
#include "STM32F7.h"

// StopBits
#define USART_STOP_BITS_NONE          0
#define USART_STOP_BITS_ONE           1
#define USART_STOP_BITS_TWO           2
#define USART_STOP_BITS_ONEPOINTFIVE  3

//Bit data length
#define STM32F7_UART_DATA_BIT_LENGTH_8    8
#define STM32F7_UART_DATA_BIT_LENGTH_9    9

bool STM32F7_Uart_TxHandshakeEnabledState(int controllerIndex);
void STM32F7_Uart_TxBufferEmptyInterruptEnable(int controllerIndex, bool enable);
void STM32F7_Uart_RxBufferFullInterruptEnable(int controllerIndex, bool enable);
void STM32F7_Uart_Reset();

typedef  USART_TypeDef* USART_TypeDef_Ptr;

struct UartDriver {
    int32_t controllerIndex;

    uint8_t *TxBuffer;
    uint8_t *RxBuffer;

    size_t txBufferCount;
    size_t txBufferIn;
    size_t txBufferOut;
    size_t txBufferSize;

    size_t rxBufferCount;
    size_t rxBufferIn;
    size_t rxBufferOut;
    size_t rxBufferSize;

    USART_TypeDef_Ptr portReg;

    bool isOpened;
    bool handshaking;

    TinyCLR_Uart_ErrorReceivedHandler errorEventHandler;
    TinyCLR_Uart_DataReceivedHandler dataReceivedEventHandler;

    const TinyCLR_Uart_Controller* controller;
};

static const STM32F7_Gpio_Pin uartTxPins[] = STM32F7_UART_TX_PINS;
static const STM32F7_Gpio_Pin uartRxPins[] = STM32F7_UART_RX_PINS;
static const STM32F7_Gpio_Pin uartCtsPins[] = STM32F7_UART_CTS_PINS;
static const STM32F7_Gpio_Pin uartRtsPins[] = STM32F7_UART_RTS_PINS;
static const uint32_t uartRxDefaultBuffersSize[] = STM32F7_UART_DEFAULT_RX_BUFFER_SIZE;
static const uint32_t uartTxDefaultBuffersSize[] = STM32F7_UART_DEFAULT_TX_BUFFER_SIZE;

#define TOTAL_UART_CONTROLLERS SIZEOF_ARRAY(uartTxPins)

static USART_TypeDef_Ptr uartPortRegs[TOTAL_UART_CONTROLLERS];

static UartDriver uartDrivers[TOTAL_UART_CONTROLLERS];
static TinyCLR_Uart_Controller uartControllers[TOTAL_UART_CONTROLLERS];
static TinyCLR_Api_Info uartApi[TOTAL_UART_CONTROLLERS];

const TinyCLR_Api_Info* STM32F7_Uart_GetApi() {
    for (int32_t i = 0; i < TOTAL_UART_CONTROLLERS; i++) {
        uartControllers[i].ApiInfo = &uartApi[i];
        uartControllers[i].Acquire = &STM32F7_Uart_Acquire;
        uartControllers[i].Release = &STM32F7_Uart_Release;
        uartControllers[i].SetActiveSettings = &STM32F7_Uart_SetActiveSettings;
        uartControllers[i].Flush = &STM32F7_Uart_Flush;
        uartControllers[i].Read = &STM32F7_Uart_Read;
        uartControllers[i].Write = &STM32F7_Uart_Write;
        uartControllers[i].SetPinChangedHandler = &STM32F7_Uart_SetPinChangedHandler;
        uartControllers[i].SetErrorReceivedHandler = &STM32F7_Uart_SetErrorReceivedHandler;
        uartControllers[i].SetDataReceivedHandler = &STM32F7_Uart_SetDataReceivedHandler;
        uartControllers[i].GetBreakSignalState = &STM32F7_Uart_GetBreakSignalState;
        uartControllers[i].SetBreakSignalState = &STM32F7_Uart_SetBreakSignalState;
        uartControllers[i].GetCarrierDetectState = &STM32F7_Uart_GetCarrierDetectState;
        uartControllers[i].GetClearToSendState = &STM32F7_Uart_GetClearToSendState;
        uartControllers[i].GetDataReadyState = &STM32F7_Uart_GetDataReadyState;
        uartControllers[i].GetIsDataTerminalReadyEnabled = &STM32F7_Uart_GetIsDataTerminalReadyEnabled;
        uartControllers[i].SetIsDataTerminalReadyEnabled = &STM32F7_Uart_SetIsDataTerminalReadyEnabled;
        uartControllers[i].GetIsRequestToSendEnabled = &STM32F7_Uart_GetIsRequestToSendEnabled;
        uartControllers[i].SetIsRequestToSendEnabled = &STM32F7_Uart_SetIsRequestToSendEnabled;
        uartControllers[i].GetReadBufferSize = &STM32F7_Uart_GetReadBufferSize;
        uartControllers[i].SetReadBufferSize = &STM32F7_Uart_SetReadBufferSize;
        uartControllers[i].GetWriteBufferSize = &STM32F7_Uart_GetWriteBufferSize;
        uartControllers[i].SetWriteBufferSize = &STM32F7_Uart_SetWriteBufferSize;
        uartControllers[i].GetUnreadCount = &STM32F7_Uart_GetUnreadCount;
        uartControllers[i].GetUnwrittenCount = &STM32F7_Uart_GetUnwrittenCount;
        uartControllers[i].ClearReadBuffer = &STM32F7_Uart_ClearReadBuffer;
        uartControllers[i].ClearWriteBuffer = &STM32F7_Uart_ClearWriteBuffer;

        uartApi[i].Author = "GHI Electronics, LLC";
        uartApi[i].Name = "GHIElectronics.TinyCLR.NativeApis.STM32F7.UartController";
        uartApi[i].Type = TinyCLR_Api_Type::UartController;
        uartApi[i].Version = 0;
        uartApi[i].Implementation = &uartControllers[i];
        uartApi[i].State = &uartDrivers[i];

        uartDrivers[i].controllerIndex = i;
    }

    if (TOTAL_UART_CONTROLLERS > 0) uartPortRegs[0] = USART1;
    if (TOTAL_UART_CONTROLLERS > 1) uartPortRegs[1] = USART2;
#if !defined(STM32F701xE) && !defined(STM32F711xE)
    if (TOTAL_UART_CONTROLLERS > 2) uartPortRegs[2] = USART3;
    if (TOTAL_UART_CONTROLLERS > 3) uartPortRegs[3] = UART4;
    if (TOTAL_UART_CONTROLLERS > 4) uartPortRegs[4] = UART5;
    if (TOTAL_UART_CONTROLLERS > 5) uartPortRegs[5] = USART6;
#ifdef UART7
    if (TOTAL_UART_CONTROLLERS > 6) uartPortRegs[6] = UART7;
#ifdef UART8
    if (TOTAL_UART_CONTROLLERS > 7) uartPortRegs[7] = UART8;
#ifdef UART9
    if (TOTAL_UART_CONTROLLERS > 8) uartPortRegs[8] = UART9;
#endif
#endif
#endif
#endif
    return (const TinyCLR_Api_Info*)&uartApi;
}

TinyCLR_Result STM32F7_Uart_GetReadBufferSize(const TinyCLR_Uart_Controller* self, size_t& size) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

