ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_UART.cpp
    int32_t controllerIndex = driver->controllerIndex;

    size = driver->rxBufferSize == 0 ? uartRxDefaultBuffersSize[controllerIndex] : driver->rxBufferSize;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_SetReadBufferSize(const TinyCLR_Uart_Controller* self, size_t size) {
    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    if (size <= 0)
        return TinyCLR_Result::ArgumentInvalid;

    if (driver->rxBufferSize) {
        memoryProvider->Free(memoryProvider, driver->RxBuffer);
    }

    driver->rxBufferSize = size;

    driver->RxBuffer = (uint8_t*)memoryProvider->Allocate(memoryProvider, size);

    if (driver->RxBuffer == nullptr) {
        driver->rxBufferSize = 0;

        return TinyCLR_Result::OutOfMemory;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_GetWriteBufferSize(const TinyCLR_Uart_Controller* self, size_t& size) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    int32_t controllerIndex = driver->controllerIndex;

    size = driver->txBufferSize == 0 ? uartTxDefaultBuffersSize[controllerIndex] : driver->txBufferSize;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_SetWriteBufferSize(const TinyCLR_Uart_Controller* self, size_t size) {
    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    if (size <= 0)
        return TinyCLR_Result::ArgumentInvalid;

    if (driver->txBufferSize) {
        memoryProvider->Free(memoryProvider, driver->TxBuffer);
    }

    driver->txBufferSize = size;

    driver->TxBuffer = (uint8_t*)memoryProvider->Allocate(memoryProvider, size);

    if (driver->TxBuffer == nullptr) {
        driver->txBufferSize = 0;

        return TinyCLR_Result::OutOfMemory;
    }

    return TinyCLR_Result::Success;
}

void STM32F7_Uart_IrqRx(int controllerIndex, uint16_t sr) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto driver = reinterpret_cast<UartDriver*>(&uartDrivers[controllerIndex]);

    uint8_t data = (uint8_t)(driver->portReg->RDR); // read RX data

    if (driver->rxBufferCount == driver->rxBufferSize) {
        if (driver->errorEventHandler != nullptr)
            driver->errorEventHandler(driver->controller, TinyCLR_Uart_Error::ReceiveFull);

        return;
    }

    driver->RxBuffer[driver->rxBufferIn++] = data;

    driver->rxBufferCount++;

    if (driver->rxBufferIn == driver->rxBufferSize)
        driver->rxBufferIn = 0;

    if (driver->dataReceivedEventHandler != nullptr)
        driver->dataReceivedEventHandler(driver->controller, 1);

    if (driver->errorEventHandler != nullptr) {
        if (sr & USART_ISR_ORE)
            driver->errorEventHandler(driver->controller, TinyCLR_Uart_Error::BufferOverrun);

        if (sr & USART_ISR_FE)
            driver->errorEventHandler(driver->controller, TinyCLR_Uart_Error::Frame);

        if (sr & USART_ISR_PE)
            driver->errorEventHandler(driver->controller, TinyCLR_Uart_Error::ReceiveParity);
    }
}

void STM32F7_Uart_IrqTx(int controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto driver = reinterpret_cast<UartDriver*>(&uartDrivers[controllerIndex]);

    if (STM32F7_Uart_TxHandshakeEnabledState(controllerIndex)) {
        if (driver->txBufferCount > 0) {
            uint8_t data = driver->TxBuffer[driver->txBufferOut++];

            driver->txBufferCount--;

            if (driver->txBufferOut == driver->txBufferSize)
                driver->txBufferOut = 0;

            driver->portReg->TDR = data; // write TX data

        }
        else {
            STM32F7_Uart_TxBufferEmptyInterruptEnable(controllerIndex, false); // Disable interrupt when no more data to send.
        }
    }
}

void STM32F7_Uart_InterruptHandler(int8_t controllerIndex, uint16_t sr) {
    if (sr & USART_ISR_RXNE)
        STM32F7_Uart_IrqRx(controllerIndex, sr);

    if (sr & USART_ISR_TXE)
        STM32F7_Uart_IrqTx(controllerIndex);
}

void STM32F7_Uart_Interrupt0(void* param) {
    uint16_t sr = USART1->ISR;

    STM32F7_Uart_InterruptHandler(0, sr);
}

void STM32F7_Uart_Interrupt1(void* param) {
    uint16_t sr = USART2->ISR;

    STM32F7_Uart_InterruptHandler(1, sr);
}

#if !defined(STM32F701xE) && !defined(STM32F711xE)
void STM32F7_Uart_Interrupt2(void* param) {
    uint16_t sr = USART3->ISR;

    STM32F7_Uart_InterruptHandler(2, sr);
}

void STM32F7_Uart_Interrupt3(void* param) {
    uint16_t sr = UART4->ISR;

    STM32F7_Uart_InterruptHandler(3, sr);
}

void STM32F7_Uart_Interrupt4(void* param) {
    uint16_t sr = UART5->ISR;

    STM32F7_Uart_InterruptHandler(4, sr);
}

void STM32F7_Uart_Interrupt5(void* param) {
    uint16_t sr = USART6->ISR;

    STM32F7_Uart_InterruptHandler(5, sr);
}
#ifdef UART7
void STM32F7_Uart_Interrupt6(void* param) {
    uint16_t sr = UART7->ISR;

    STM32F7_Uart_InterruptHandler(6, sr);
}
#ifdef UART8
void STM32F7_Uart_Interrupt7(void* param) {
    uint16_t sr = UART8->ISR;

    STM32F7_Uart_InterruptHandler(7, sr);
}
#ifdef UART9
void STM32F7_Uart_Interrupt8(void* param) {
    uint16_t sr = UART9->ISR;

    STM32F7_Uart_InterruptHandler(8, sr);
}
#endif
#endif
#endif
#endif

TinyCLR_Result STM32F7_Uart_Acquire(const TinyCLR_Uart_Controller* self) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    int32_t controllerIndex = driver->controllerIndex;

    if (controllerIndex >= TOTAL_UART_CONTROLLERS)
        return TinyCLR_Result::ArgumentInvalid;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (driver->isOpened || !STM32F7_GpioInternal_OpenPin(uartRxPins[controllerIndex].number) || !STM32F7_GpioInternal_OpenPin(uartTxPins[controllerIndex].number))
        return TinyCLR_Result::SharingViolation;

    driver->txBufferCount = 0;
    driver->txBufferIn = 0;
    driver->txBufferOut = 0;

    driver->rxBufferCount = 0;
    driver->rxBufferIn = 0;
    driver->rxBufferOut = 0;

    driver->portReg = uartPortRegs[controllerIndex];
    driver->controller = self;

    driver->handshaking = false;

