ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_UART.cpp
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    int32_t controllerIndex = driver->controllerIndex;

    driver->portReg->CR1 = 0; // stop uart

    switch (controllerIndex) {
    case 0:
        STM32F7_InterruptInternal_Deactivate(USART1_IRQn);
        break;

    case 1:
        STM32F7_InterruptInternal_Deactivate(USART2_IRQn);
        break;
#if !defined(STM32F701xE) && !defined(STM32F711xE)
    case 2:
        STM32F7_InterruptInternal_Deactivate(USART3_IRQn);
        break;

    case 3:
        STM32F7_InterruptInternal_Deactivate(UART4_IRQn);
        break;

    case 4:
        STM32F7_InterruptInternal_Deactivate(UART5_IRQn);
        break;

    case 5:
        STM32F7_InterruptInternal_Deactivate(USART6_IRQn);
        break;

#ifdef UART7
    case 6:
        STM32F7_InterruptInternal_Deactivate(UART7_IRQn);
        break;

#ifdef UART8
    case 7:
        STM32F7_InterruptInternal_Deactivate(UART8_IRQn);
        break;

#ifdef UART9
    case 8:
        STM32F7_InterruptInternal_Deactivate(UART9_IRQn);
        break;
#endif
#endif
#endif
#endif
    }

    STM32F7_Uart_RxBufferFullInterruptEnable(controllerIndex, false);
    STM32F7_Uart_TxBufferEmptyInterruptEnable(controllerIndex, false);

    // disable UART clock
    if (controllerIndex == 5) { // COM6 on APB2
        RCC->APB2ENR &= ~RCC_APB2ENR_USART6EN;
    }
    else if (controllerIndex == 0) { // COM1 on APB2
        RCC->APB2ENR &= ~RCC_APB2ENR_USART1EN;
    }
    else if (controllerIndex < 5) { // COM2-5 on APB1
        RCC->APB1ENR &= ~(RCC_APB1ENR_USART2EN >> 1 << controllerIndex);
    }
#if !defined(STM32F701xE) && !defined(STM32F711xE)
#ifdef UART7
    else if (controllerIndex == 6) {
        RCC->APB1ENR &= ~RCC_APB1ENR_UART7EN;
    }

#ifdef UART8
    else if (controllerIndex == 7) {
        RCC->APB1ENR &= ~RCC_APB1ENR_UART8EN;
    }

#ifdef UART9
    else if (controllerIndex == 8) {
        RCC->APB2ENR &= ~RCC_APB2ENR_UART9EN;
    }
#endif
#endif
#endif
#endif
    if (apiManager != nullptr) {
        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        if (driver->txBufferSize != 0) {
            memoryProvider->Free(memoryProvider, driver->TxBuffer);

            driver->txBufferSize = 0;
        }

        if (driver->rxBufferSize != 0) {
            memoryProvider->Free(memoryProvider, driver->RxBuffer);

            driver->rxBufferSize = 0;
        }
    }

    if (driver->isOpened) {
        STM32F7_GpioInternal_ClosePin(uartRxPins[controllerIndex].number);
        STM32F7_GpioInternal_ClosePin(uartTxPins[controllerIndex].number);

        if (driver->handshaking) {
            STM32F7_GpioInternal_ClosePin(uartCtsPins[controllerIndex].number);
            STM32F7_GpioInternal_ClosePin(uartRtsPins[controllerIndex].number);
        }
    }

    driver->isOpened = false;

    return TinyCLR_Result::Success;
}

void STM32F7_Uart_Reset() {
    for (auto i = 0; i < TOTAL_UART_CONTROLLERS; i++) {
        uartDrivers[i].txBufferSize = 0;
        uartDrivers[i].rxBufferSize = 0;

        STM32F7_Uart_Release(&uartControllers[i]);

        uartDrivers[i].isOpened = false;
    }
}

void STM32F7_Uart_TxBufferEmptyInterruptEnable(int controllerIndex, bool enable) {
    auto driver = &uartDrivers[controllerIndex];

    if (enable) {
        driver->portReg->CR1 |= USART_CR1_TXEIE;  // tx int enable
    }
    else {
        driver->portReg->CR1 &= ~USART_CR1_TXEIE; // tx int disable
    }
}

void STM32F7_Uart_RxBufferFullInterruptEnable(int controllerIndex, bool enable) {
    auto driver = &uartDrivers[controllerIndex];

    if (enable) {
        driver->portReg->CR1 |= USART_CR1_RXNEIE;  // rx int enable
    }
    else {
        driver->portReg->CR1 &= ~USART_CR1_RXNEIE; // rx int disable
    }
}

bool STM32F7_Uart_TxHandshakeEnabledState(int controllerIndex) {
    auto driver = &uartDrivers[controllerIndex];

    // The state of the CTS input only matters if Flow Control is enabled
    if (driver->portReg->CR3 & USART_CR3_CTSE) {
        TinyCLR_Gpio_PinValue value;

        STM32F7_Gpio_Read(nullptr, uartCtsPins[controllerIndex].number, value);

        return !(value == TinyCLR_Gpio_PinValue::High);
    }

    return true; // If this handshake input is not being used, it is assumed to be good
}

TinyCLR_Result STM32F7_Uart_Flush(const TinyCLR_Uart_Controller* self) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    if (driver->isOpened) {
        while (driver->txBufferCount > 0) {
            STM32F7_Time_Delay(nullptr, 1);
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_Read(const TinyCLR_Uart_Controller* self, uint8_t* buffer, size_t& length) {

    size_t i = 0;;

    DISABLE_INTERRUPTS_SCOPED(irq);

    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    if (driver->isOpened == false) {
        return TinyCLR_Result::NotAvailable;
    }

    length = std::min(driver->rxBufferCount, length);

    while (i < length) {
        buffer[i++] = driver->RxBuffer[driver->rxBufferOut];

        driver->rxBufferOut++;

        driver->rxBufferCount--;

        if (driver->rxBufferOut == driver->rxBufferSize)
            driver->rxBufferOut = 0;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_Write(const TinyCLR_Uart_Controller* self, const uint8_t* buffer, size_t& length) {

    int32_t i = 0;

    DISABLE_INTERRUPTS_SCOPED(irq);

    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    int32_t controllerIndex = driver->controllerIndex;

    if (driver->isOpened == false) {
        return TinyCLR_Result::NotAvailable;
    }

    length = std::min(driver->txBufferSize - driver->txBufferCount, length);

    if (driver->txBufferCount == driver->txBufferSize) {
        if (driver->errorEventHandler != nullptr)
            driver->errorEventHandler(driver->controller, TinyCLR_Uart_Error::TransmitFull);

