ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_UART.cpp
        return TinyCLR_Result::Success;
    }

    while (i < length) {

        driver->TxBuffer[driver->txBufferIn] = buffer[i++];

        driver->txBufferCount++;

        driver->txBufferIn++;

        if (driver->txBufferIn == driver->txBufferSize)
            driver->txBufferIn = 0;
    }

    if (length > 0) {
        STM32F7_Uart_TxBufferEmptyInterruptEnable(controllerIndex, true); // Enable Tx to start transfer
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_SetPinChangedHandler(const TinyCLR_Uart_Controller* self, TinyCLR_Uart_PinChangedHandler handler) {
    //TODO
    return TinyCLR_Result::Success;
}
TinyCLR_Result STM32F7_Uart_SetErrorReceivedHandler(const TinyCLR_Uart_Controller* self, TinyCLR_Uart_ErrorReceivedHandler handler) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    driver->errorEventHandler = handler;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_SetDataReceivedHandler(const TinyCLR_Uart_Controller* self, TinyCLR_Uart_DataReceivedHandler handler) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    driver->dataReceivedEventHandler = handler;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_GetBreakSignalState(const TinyCLR_Uart_Controller* self, bool& state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_SetBreakSignalState(const TinyCLR_Uart_Controller* self, bool state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_GetCarrierDetectState(const TinyCLR_Uart_Controller* self, bool& state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_GetClearToSendState(const TinyCLR_Uart_Controller* self, bool& state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_GetDataReadyState(const TinyCLR_Uart_Controller* self, bool& state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_GetIsDataTerminalReadyEnabled(const TinyCLR_Uart_Controller* self, bool& state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_SetIsDataTerminalReadyEnabled(const TinyCLR_Uart_Controller* self, bool state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_GetIsRequestToSendEnabled(const TinyCLR_Uart_Controller* self, bool& state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_SetIsRequestToSendEnabled(const TinyCLR_Uart_Controller* self, bool state) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result STM32F7_Uart_GetUnreadCount(const TinyCLR_Uart_Controller* self, size_t& count) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    count = driver->rxBufferCount;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_GetUnwrittenCount(const TinyCLR_Uart_Controller* self, size_t& count) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    count = driver->txBufferCount;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_ClearReadBuffer(const TinyCLR_Uart_Controller* self) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    driver->rxBufferCount = driver->rxBufferIn = driver->rxBufferOut = 0;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Uart_ClearWriteBuffer(const TinyCLR_Uart_Controller* self) {
    auto driver = reinterpret_cast<UartDriver*>(self->ApiInfo->State);

    driver->txBufferCount = driver->txBufferIn = driver->txBufferOut = 0;

    return TinyCLR_Result::Success;
}